lvx/base/Catalogs/СценарииПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СценарииПланирования</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Периодичность</Name>
					<Comment>Периодичность планирования</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьИнтервала</Name>
					<Comment>Продолжительность интервала планирования (количество периодов планирования)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьКонтроля</Name>
					<Comment>Периодичность контроля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКурсыСценария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповойСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьКонтрольЗаявокПоЛимитам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьКонтрольГрафиковДоговоровПоЛимитам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/InformationRegisters/бит_КурсыСценариевПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_КурсыСценариевПланирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_КонтекстыВыполненияПользовательскихФункций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_КонтекстыВыполненияПользовательскихФункций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
					<Comment>Произвольный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимыеОбороты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаЭксель</Name>
					<Comment>Загрузка Excell</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФинансовыеДоговора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Catalogs/СценарииПланирования/Forms/ФормаНастройкиЗаполненияКурсов/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Способы заполнения:
// 1 - копировать из курсов валют
// 2 - заполнить используя линейное заполнение
// 3 - заполнить по произвольному алгоритму

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Заполнение реквизитов по параметрам
	ВалютаЗаполнения 		= Параметры.ВалютаЗаполнения;
	ДатаНачала 				= Параметры.ДатаНачала;
	ДатаОкончания 			= Параметры.ДатаОкончания;
	ДлинаИнтервала 			= Параметры.ДлинаИнтервала;
	КоличествоШагов 		= Параметры.КоличествоШагов;
	НачальныйКурс 			= Параметры.НачальныйКурс;
	ПериодичностьЗаполнения = Объект.бит_Периодичность;
	СпособЗаполнения 		= Параметры.СпособЗаполнения;
	
	УправлениеВидимостьюДоступностью();	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНастроитьПериод(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОткрытьДиалогСтандартногоПериодаПоДатам(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
		
	КурсыЗаполнены = ВыполнитьЗаполнениеКурсов();
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьФункциюСПараметрами(Команда)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияПользовательскойФункции();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
	ОткрытьФорму("Справочник.бит_ПользовательскиеФункции.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	КурсыЗаполнены = ВыполнитьЗаполнениеКурсов();		
	Если КурсыЗаполнены Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

// Процедура выполняет заполнение курсов сценария.
//
&НаКлиенте
Функция ВыполнитьЗаполнениеКурсов()

	Отказ = Ложь;
	
	Если СпособЗаполнения = 1 Тогда
		
		КопироватьИзКурсовВалют();
		
	ИначеЕсли СпособЗаполнения = 2 Тогда
		
		Если ДлинаИнтервала = 0 Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Длина интервала';en='The length of the interval'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ДлинаИнтервала",, Отказ); 
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПериодичностьЗаполнения) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Периодичность';en='Periodicity'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ПериодичностьЗаполнения",, Отказ); 
		КонецЕсли;
		Если КоличествоШагов = 0 Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Количество шагов';en='Number of steps'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "КоличествоШагов",, Отказ);
		КонецЕсли;
		
		Если Не Отказ Тогда
			ЗаполнитьИспользуяЛинейноеЗаполнение(); 
		КонецЕсли;				
		
	ИначеЕсли СпособЗаполнения = 3 Тогда
		
		Если ДлинаИнтервала = 0 Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Длина интервала';en='The length of the interval'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ДлинаИнтервала",, Отказ); 
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПериодичностьЗаполнения) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Периодичность';en='Periodicity'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ПериодичностьЗаполнения",, Отказ); 
		КонецЕсли;
		Если КоличествоШагов = 0 Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Количество шагов';en='Number of steps'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "КоличествоШагов",, Отказ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ПользовательскаяФункция) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Пользовательская функция';en='Custom function'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ПользовательскаяФункция",, Отказ);
		КонецЕсли;
		
		АлгоритмБезОшибок = ПроверитьПроизвольныйАлгоритм();		
		Если АлгоритмБезОшибок Тогда			
			Заполненно = ЗаполнитьПоПроизвольномуАлгоритму();
			Если Не Заполненно Тогда
				Отказ = Истина;			
			КонецЕсли;
		Иначе
			Отказ = Истина;	
		КонецЕсли;
		
	КонецЕсли;
	
	// Обновление списков в других формах.
	Если Не Отказ Тогда
		ОповеститьОбИзменении(Объект.Ссылка);
		Если ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы") Тогда
			ВладелецФормы.Обновить(); 
		КонецЕсли;		
	КонецЕсли;
	
	КурсыЗаполнены = Не Отказ;
	Возврат КурсыЗаполнены;

КонецФункции

// Функция выполняет синтаксический контроль произвольного алгоритма описанного в пользовательской функции.
//
// Возвращаемое значение:
//	Булево.
//
&НаСервере
Функция ПроверитьПроизвольныйАлгоритм()
	
	АлгоритмБезОшибок = Истина;
	
	Результат = 0;
	
	// Проверим работу функции со значениями по умолчанию.
	Сценарий 	= Объект.Ссылка;
	НомерШага 	= 1;
	ПериодКурса = ДатаНачала;
	
	КодРасчета = ПользовательскаяФункция.КодПодпрограммы;
	
	ТекстСообщения = СтрШаблон(НСтр("ru='В алгоритме обнаружены ошибки:';en='The algorithm has errors:'")) + Символы.ПС;		
	АлгоритмБезОшибок = ВыполнитьПроизвольныйАлгоритм(ТекстСообщения, "ПользовательскаяФункция"); 	
		
	Возврат АлгоритмБезОшибок;
	
КонецФункции

// Процедура управляет отображением элементов формы.
//
&НаСервере
Процедура УправлениеВидимостьюДоступностью()

	ЭтоСпособ_1 = СпособЗаполнения = 1;
	ЭтоСпособ_2 = СпособЗаполнения = 2;
	ЭтоСпособ_3 = СпособЗаполнения = 3;
	
	Элементы.КомандаСоздатьФункциюСПараметрами.Видимость 		= ЭтоСпособ_3;	
	Элементы.ГруппаКопироватьИзКурсовВалют.Видимость 			= ЭтоСпособ_1;
	Элементы.ГруппаЛинейноеЗаполнение.Видимость 				= ЭтоСпособ_2;
	Элементы.ГруппаЗаполнениеПоПроизвольномуАлгоритму.Видимость = ЭтоСпособ_3;
                  		
	Если ЭтоСпособ_1 Тогда 		
		Элементы.ПанельВариантыНастроек.ТекущаяСтраница = Элементы.СтраницаКопироватьИзКурсовВалют;
	ИначеЕсли ЭтоСпособ_2 Тогда		
	  	Элементы.ПанельВариантыНастроек.ТекущаяСтраница = Элементы.СтраницаЗаполнитьИспользуяЛинейноеЗаполнение;
	ИначеЕсли ЭтоСпособ_3 Тогда 		
	  	Элементы.ПанельВариантыНастроек.ТекущаяСтраница = Элементы.СтраницаЗаполнитьПоПроизвольномуАлгоритму;
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует структуру параметров, которые могут быть использованы в пользовательской функции.
//
&НаСервере
Функция СформироватьСтруктуруПараметровПользовательскойФункции()
	
	СтруктураПараметров = Новый Структура;
	
	
	СтруктураПараметров.Вставить("Сценарий", Новый Структура("ТипПараметра,ЗначениеПоУмолчанию",
													Новый ХранилищеЗначения(Новый ОписаниеТипов("СправочникСсылка.СценарииПланирования")),
													Объект.Ссылка));
													
	СтруктураПараметров.Вставить("ВалютаЗаполнения", Новый Структура("ТипПараметра,ЗначениеПоУмолчанию",
													Новый ХранилищеЗначения(Новый ОписаниеТипов("СправочникСсылка.Валюты")),
													ВалютаЗаполнения)); 
													
	СтруктураПараметров.Вставить("ПериодКурса", Новый Структура("ТипПараметра,ЗначениеПоУмолчанию",
													Новый ХранилищеЗначения(Новый ОписаниеТипов("Дата")),
													ДатаНачала));
													
	СтруктураПараметров.Вставить("ДатаНачала", Новый Структура("ТипПараметра,ЗначениеПоУмолчанию",
													Новый ХранилищеЗначения(Новый ОписаниеТипов("Дата")),
													ДатаНачала));
													
	СтруктураПараметров.Вставить("ДлинаИнтервала", Новый Структура("ТипПараметра,ЗначениеПоУмолчанию",
													Новый ХранилищеЗначения(Новый ОписаниеТипов("Число")),
													ДлинаИнтервала));
													
	СтруктураПараметров.Вставить("НачальныйКурс", Новый Структура("ТипПараметра,ЗначениеПоУмолчанию",
													Новый ХранилищеЗначения(Новый ОписаниеТипов("Число")),
													НачальныйКурс));
													
	СтруктураПараметров.Вставить("КоличествоШагов", Новый Структура("ТипПараметра,ЗначениеПоУмолчанию",
													Новый ХранилищеЗначения(Новый ОписаниеТипов("Число")),
													КоличествоШагов));
													
	СтруктураПараметров.Вставить("Приращение", Новый Структура("ТипПараметра,ЗначениеПоУмолчанию",
													Новый ХранилищеЗначения(Новый ОписаниеТипов("Число")),
													Приращение));
													
	СтруктураПараметров.Вставить("НомерШага", Новый Структура("ТипПараметра,ЗначениеПоУмолчанию",
													Новый ХранилищеЗначения(Новый ОписаниеТипов("Число")),
													1));
													
	Возврат СтруктураПараметров;
	
КонецФункции

// Процедура создает функцию с параметрами.
//
&НаСервере
Функция ПараметрыЗаполненияПользовательскойФункции()

	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("Наименование", 	 НСтр("ru='Заполнение курсов сценария';en='Filling in the script courses'"));
	ПараметрыЗаполнения.Вставить("Контекст", 		 Перечисления.бит_КонтекстыВыполненияПользовательскихФункций.Произвольный);
	ПараметрыЗаполнения.Вставить("КодПодпрограммы",  "Результат = НачальныйКурс + Приращение * (НомерШага-1);");
	ПараметрыЗаполнения.Вставить("ПараметрыФункции", СформироватьСтруктуруПараметровПользовательскойФункции());
	
	Возврат ПараметрыЗаполнения;

КонецФункции

// Процедура дополняет переданную ТаблицуКурсов за определенный период курсами, уже имеющимися в регистре.
//
// Параметры:
//	ТаблицаКурсов - таблица значений - содержит курсы сценариев сформированные одним из способов заполнения.
//
&НаСервере
Процедура ДополнитьИЗаписатьВРегистрТаблицуКурсов(ТаблицаКурсов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаКурсов.Период,
	|	ТаблицаКурсов.Сценарий,
	|	ТаблицаКурсов.Валюта,
	|	ТаблицаКурсов.Курс,
	|	ТаблицаКурсов.Кратность
	|ПОМЕСТИТЬ ТаблицаКурсов
	|ИЗ
	|	&ТаблицаКурсов КАК ТаблицаКурсов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_КурсыСценариевПланирования.Период,
	|	бит_КурсыСценариевПланирования.Сценарий,
	|	бит_КурсыСценариевПланирования.Валюта,
	|	бит_КурсыСценариевПланирования.Курс,
	|	бит_КурсыСценариевПланирования.Кратность
	|ПОМЕСТИТЬ КурсыСценариевПланирования
	|ИЗ
	|	РегистрСведений.бит_КурсыСценариевПланирования КАК бит_КурсыСценариевПланирования
	|ГДЕ
	|	бит_КурсыСценариевПланирования.Сценарий = &Сценарий
	|	И бит_КурсыСценариевПланирования.Валюта = &ВалютаЗаполнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаКурсов.Период ЕСТЬ NULL 
	|			ТОГДА КурсыСценариевПланирования.Период
	|		ИНАЧЕ ТаблицаКурсов.Период
	|	КОНЕЦ КАК Период,
	|	ВЫБОР
	|		КОГДА ТаблицаКурсов.Сценарий ЕСТЬ NULL 
	|			ТОГДА КурсыСценариевПланирования.Сценарий
	|		ИНАЧЕ ТаблицаКурсов.Сценарий
	|	КОНЕЦ КАК Сценарий,
	|	ВЫБОР
	|		КОГДА ТаблицаКурсов.Валюта ЕСТЬ NULL 
	|			ТОГДА КурсыСценариевПланирования.Валюта
	|		ИНАЧЕ ТаблицаКурсов.Валюта
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ТаблицаКурсов.Период ЕСТЬ NULL 
	|			ТОГДА КурсыСценариевПланирования.Курс
	|		ИНАЧЕ ТаблицаКурсов.Курс
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА ТаблицаКурсов.Период ЕСТЬ NULL 
	|			ТОГДА КурсыСценариевПланирования.Кратность
	|		ИНАЧЕ ТаблицаКурсов.Кратность
	|	КОНЕЦ КАК Кратность
	|ИЗ
	|	КурсыСценариевПланирования КАК КурсыСценариевПланирования
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаКурсов КАК ТаблицаКурсов
	|		ПО КурсыСценариевПланирования.Сценарий = ТаблицаКурсов.Сценарий
	|			И КурсыСценариевПланирования.Период = ТаблицаКурсов.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаКурсов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ КурсыСценариевПланирования
	|";
	
	Запрос.УстановитьПараметр("ТаблицаКурсов"	, ТаблицаКурсов);
	Запрос.УстановитьПараметр("Сценарий"	 	, Объект.Ссылка);
	Запрос.УстановитьПараметр("ВалютаЗаполнения", ВалютаЗаполнения);
	
	Результат 		  = Запрос.Выполнить();
	ТаблицаВсехКурсов = Результат.Выгрузить();
	
	НаборКурсыСценария = РегистрыСведений.бит_КурсыСценариевПланирования.СоздатьНаборЗаписей();
	
	НаборКурсыСценария.Отбор.Сценарий.Установить(Объект.Ссылка);
	НаборКурсыСценария.Отбор.Валюта.Установить(ВалютаЗаполнения);
	
	НаборКурсыСценария.Загрузить(ТаблицаВсехКурсов);
	
	НаборКурсыСценария.Записать();
	
КонецПроцедуры

// Функция выполняет синтаксический контроль произвольного алгоритма описанного в пользовательской функции.
//
// Параметры:
//  ЗаголовокСообщения - Строка.
//  ПутьПоля 		   - Строка.
//
// Возвращаемое значение:
//	Булево.
//
&НаСервере
Функция ВыполнитьПроизвольныйАлгоритм(ЗаголовокСообщения, ПутьПоля)
	
	Отказ = Ложь;
	Результат = ВыполнитьПользовательскуюФункциюРасчетаКурса(1, ДатаНачала, Отказ, ЗаголовокСообщения, ПутьПоля);
	Возврат Не Отказ;
	
КонецФункции

// Функция выполняет расчет курса сценария для конкретного периода и шага.
//
// Параметры:
//	НомерШага   	   - Число (Номер шага на котором производится расчет курса).
//	ПериодКурса 	   - Дата  (Дата, на которую рассчитывается курс).
//	Отказ 			   - Булево.
//  ЗаголовокСообщения - Строка (По умолчанию = "").
//  ПутьПоля 		   - Строка (По умолчанию = "").
//
// Возвращаемое значение:
//  Число.
//
&НаСервере
Функция ВыполнитьПользовательскуюФункциюРасчетаКурса(НомерШага, ПериодКурса, Отказ, ЗаголовокСообщения = "", ПутьПоля = "")
	
	Результат  = 0;
	Сценарий   = Объект.Ссылка;
	КодРасчета = ПользовательскаяФункция.КодПодпрограммы;
	
	Попытка
		Выполнить(КодРасчета);
		Если НЕ ТипЗнч(Результат) = Тип("Число") Тогда
			ТекстСообщения = НСтр("ru='%1Пользовательская функция должна возвращать числовое значение.';
								  |en='%1Custom function should return a numeric value.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗаголовокСообщения, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ПутьПоля,, Отказ);
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru='%1Ошибка при выполнении пользовательской функции: %2.';
							  |en='%1Error during execution of user-defined function:% 2.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗаголовокСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ПутьПоля,, Отказ);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Процедура заполняет регистр "бит_КурсыСценариевПланирования" данными из регистра "КурсыВалют" за указанный период.
//
&НаСервере
Процедура КопироватьИзКурсовВалют()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КурсыВалют.Период,
	|	&Сценарий КАК Сценарий,
	|	КурсыВалют.Валюта,
	|	КурсыВалют.Курс,
	|	КурсыВалют.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И КурсыВалют.Валюта = &Валюта
	|АВТОУПОРЯДОЧИВАНИЕ
	|";
	
	Запрос.УстановитьПараметр("ДатаНачала",    ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Валюта", 	   ВалютаЗаполнения);
	Запрос.УстановитьПараметр("Сценарий", 	   Объект.Ссылка);
	
	Результат 		= Запрос.Выполнить();
	ТаблицаКурсов 	= Результат.Выгрузить();
	
	ДополнитьИЗаписатьВРегистрТаблицуКурсов(ТаблицаКурсов);
	
КонецПроцедуры

// Процедура заполняет регистр "бит_КурсыСценариевПланирования" в соответствии с указанными параметрами.
//
&НаСервере
Процедура ЗаполнитьИспользуяЛинейноеЗаполнение()
		
	ТаблицаКурсов = Новый ТаблицаЗначений;	
	ТаблицаКурсов.Колонки.Добавить("Период", 	Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаКурсов.Колонки.Добавить("Сценарий",  Новый ОписаниеТипов("СправочникСсылка.СценарииПланирования"));
	ТаблицаКурсов.Колонки.Добавить("Валюта", 	Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаКурсов.Колонки.Добавить("Курс", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 4, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаКурсов.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	
	Для Ном = 0 По КоличествоШагов - 1 Цикл
		
		Если Ном = 0 Тогда
			ПериодКурса = ДатаНачала;
		Иначе
			СдвигПериода = Ном * ДлинаИнтервала;
			ПериодКурса  = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ДатаНачала, СдвигПериода, ПериодичностьЗаполнения);
		КонецЕсли;
		
		НовыйКурс = НачальныйКурс + Приращение * Ном;
		
		НоваяСтрокаКурса = ТаблицаКурсов.Добавить();		
		НоваяСтрокаКурса.Период 	= ПериодКурса;
		НоваяСтрокаКурса.Сценарий 	= Объект.Ссылка;
		НоваяСтрокаКурса.Валюта		= ВалютаЗаполнения;
		НоваяСтрокаКурса.Курс 		= НовыйКурс;
		НоваяСтрокаКурса.Кратность  = 1;
		
	КонецЦикла;
	
	ДополнитьИЗаписатьВРегистрТаблицуКурсов(ТаблицаКурсов);
	
КонецПроцедуры

// Процедура заполняет регистр "бит_КурсыСценариевПланирования" в соответствии с указанными настройками 
//	и произвольным выражением расчета курса
//
// Возвращаемое значение:
//	Булево.
//
&НаСервере
Функция ЗаполнитьПоПроизвольномуАлгоритму()
	
	Отказ = Ложь;
		
	ТаблицаКурсов = Новый ТаблицаЗначений;	
	ТаблицаКурсов.Колонки.Добавить("Период", 	Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаКурсов.Колонки.Добавить("Сценарий", 	Новый ОписаниеТипов("СправочникСсылка.СценарииПланирования"));
	ТаблицаКурсов.Колонки.Добавить("Валюта", 	Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаКурсов.Колонки.Добавить("Курс", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 4, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаКурсов.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	
	Для Ном = 1 По КоличествоШагов Цикл
		
		Если Ном = 1 Тогда
			ПериодКурса = ДатаНачала;
		Иначе
			СдвигПериода = (Ном - 1) * ДлинаИнтервала;
			ПериодКурса  = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ДатаНачала, СдвигПериода, ПериодичностьЗаполнения);
		КонецЕсли;
		
		НовыйКурс = ВыполнитьПользовательскуюФункциюРасчетаКурса(Ном, ПериодКурса, Отказ);
		
		НоваяСтрокаКурса = ТаблицаКурсов.Добавить();		
		НоваяСтрокаКурса.Период 	= ПериодКурса;
		НоваяСтрокаКурса.Сценарий 	= Объект.Ссылка;
		НоваяСтрокаКурса.Валюта 	= ВалютаЗаполнения;
		НоваяСтрокаКурса.Курс 		= НовыйКурс;
		НоваяСтрокаКурса.Кратность  = 1;
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		ДополнитьИЗаписатьВРегистрТаблицуКурсов(ТаблицаКурсов);
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

#КонецОбласти
